In [505]:
import pandas as pd 
from pandas import DataFrame

In [506]:
data = DataFrame(
    data=[['서울',12000,15000],    ['경기',75000,18000],     ['제주',63000,66000] , ['부산',42000,50000]],
        #index=['1','2','3'],
        columns=['city','total1','total2']
    )

data22222 = {'city':['서울','경기','제주','부산']}

data.dtypes

city      object
total1     int64
total2     int64
dtype: object

In [507]:
data.city.dtype

dtype('O')

In [508]:
data.dtypes

city      object
total1     int64
total2     int64
dtype: object

In [509]:
### 자료형 변경~~~~~~~~~~~~~~~ 방법은 여러가지 있어요 

# 방법1  apply 함수 
# 문법:  데이터프레임.컬럼명.apply(파이썬 기본자료형CLASS 명 )

In [510]:
data.total1.apply(str)
# 복사본에다 적용한것이므로 ,

0    12000
1    75000
2    63000
3    42000
Name: total1, dtype: object

In [511]:
data.dtypes # 따로 대입이나 inplace 안되어있으면, 원본에 전혀 반영 안된 것 확인가능!

city      object
total1     int64
total2     int64
dtype: object

In [512]:
# total2 를 문자열로 변환후 total2_copy 컬럼추가

# 판다스에서 문자열이  object 로 나온다.

data['total2'].apply(str)
data.total2.apply(str)

data['total2_copy']= data.total2.apply(str)
data.dtypes

city           object
total1          int64
total2          int64
total2_copy    object
dtype: object

In [513]:
data = DataFrame(
data=[['서울',12000,15000],    ['경기',75000,18000],     ['제주',63000,66000] , ['부산',42000,50000]],
    #index=['1','2','3'],
    columns=['city','total1','total2']
)
data['total2'].apply(str)
data.total2.apply(str)

data['total2_copy']= data.total2.apply(str)
data.dtypes

city           object
total1          int64
total2          int64
total2_copy    object
dtype: object

In [514]:
data

  city  total1  total2 total2_copy
0   서울   12000   15000       15000
1   경기   75000   18000       18000
2   제주   63000   66000       66000
3   부산   42000   50000       50000

In [515]:
##방법2  to_numeric 함수, 
# pandas.to_numeric(데이터프레임['컬럼명'])
##\object to int 
data['total2_copy'] = pd.to_numeric(data['total2_copy'])    
data.dtypes

city           object
total1          int64
total2          int64
total2_copy     int64
dtype: object

In [516]:
'''
방법3 astype 함수 
1 - 데이터프레임['컬럼명'].astype(자료형)
2 - 데이터프레임.astype({'컬럼명' : 자료형, '컬럼명' : 자료형})

열거적으로 선언해서 데이터프레임을 생성해줄수있다! 


'''

data['total1'].astype(float)

0    12000.0
1    75000.0
2    63000.0
3    42000.0
Name: total1, dtype: float64

In [517]:
# float32는 파이썬의 기본자료형이 아님! 
# 아니라면 그럼 못쓰나? 그것도아니다.  문자열도 먹여주면 된다. 
# 판다스 라이브러리는 float32 도지원해주기때문이다. 
data['total1'].astype('float32')

0    12000.0
1    75000.0
2    63000.0
3    42000.0
Name: total1, dtype: float32

In [518]:
#data['total1'].astype(int64)#에러남
data['total1'].astype('int64')#에러안남

0    12000
1    75000
2    63000
3    42000
Name: total1, dtype: int64

In [519]:
'''

astype 으로 한 컬럼만 변경했다. 
2개이상의 타입을 한꺼번에 바꾸려면 어떻게하는가. 

'''
data.dtypes

city           object
total1          int64
total2          int64
total2_copy     int64
dtype: object

In [520]:
print(data)
data= data.astype({'total1':int , 'total2': 'float'})
'''
data.astype({'total1':int , 'total2': 'int64'}) 
는 작업 결과를 복사한 데이터뭉치를 return 해준다.

data = data.astype({'total1':int , 'total2': 'int64'}) 를 하면
data 에 새로 작업결과로 복사된 녀석이 할당된다는 것을 알수있다. 

'''
data.dtypes

  city  total1  total2  total2_copy
0   서울   12000   15000        15000
1   경기   75000   18000        18000
2   제주   63000   66000        66000
3   부산   42000   50000        50000

city            object
total1           int32
total2         float64
total2_copy      int64
dtype: object

In [521]:
data

  city  total1   total2  total2_copy
0   서울   12000  15000.0        15000
1   경기   75000  18000.0        18000
2   제주   63000  66000.0        66000
3   부산   42000  50000.0        50000

In [522]:
data.dtypes

city            object
total1           int32
total2         float64
total2_copy      int64
dtype: object

In [523]:
 # 경기의 total2_copy 값을 '없음' 으로 변경하면?

data.loc[1, 'total2_copy']  ='없음'
  # 없음 이 들어오자마자  type 가 object 로 변경됨

In [524]:
data.dtypes

city            object
total1           int32
total2         float64
total2_copy     object
dtype: object

In [525]:
# 그러면 이걸또 int 로 바꾸려고해요. 
# 없음을 0 으로 바꿔주는 로직이 필요하다. 

# int 로강제 변환? 
#  비 int 는 default 인 0 으로 변화시켜주는 편리한 로직 있음 좋겠다. . . 

#data['total2_copy'].apply(pd.to_numeric)
# 용법, ValueError: Unable to parse string "없음" 
data['total2_copy'].apply(pd.to_numeric, errors='coerce')
# coerce 를 먹여준다.
#data['total2_copy'].apply(int, errors='coerce')
# int 는 또 지원을 안한다.  errors 라는 매개변수를 지원을안해요 
# to_numeric 에서만 지원해요;.

0    15000.0
1        NaN
2    66000.0
3    50000.0
Name: total2_copy, dtype: float64

In [526]:
data['total2_copy'].astype(int, errors='ignore')
# ValueError: invalid literal for int() with base 10: '없음'
# ignore 을먹여주면 에러는 안나고 그냥 팅긴다. 변하지 않는다. 
# 디폴트로 errors: str = "raise") 
# 가 먹여져 있어서 에러가 난거에요 .

0    15000
1       없음
2    66000
3    50000
Name: total2_copy, dtype: object

In [527]:
data['total2_copy']= data['total2_copy'].apply(pd.to_numeric, errors='coerce')
# coerce 는 먹여지지 않는다.
data 
# Nan 으로 나온 부분 ->> 손실 되었다.

  city  total1   total2  total2_copy
0   서울   12000  15000.0      15000.0
1   경기   75000  18000.0          NaN
2   제주   63000  66000.0      66000.0
3   부산   42000  50000.0      50000.0

In [528]:
## 결측치를 확인해보기
data.info()

# 결측치 케이스 
# Na , Nan , Null

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   city         4 non-null      object
 1   total1       4 non-null      int32
 2   total2       4 non-null      float64
 3   total2_copy  3 non-null      float64
dtypes: float64(2), int32(1), object(1)
memory usage: 240.0+ bytes

In [529]:
#결측치 확인 : 마스크(논리값)
data.isnull()
data.isna()# data.isnull() 와 같은 함수다!

    city  total1  total2  total2_copy
0  False   False   False        False
1  False   False   False         True
2  False   False   False        False
3  False   False   False        False

In [530]:
# 특정 컬럼에 대해서 결측치를 확인한다. : 마스크 활용
data['total2_copy'].isna()

0    False
1     True
2    False
3    False
Name: total2_copy, dtype: bool

In [531]:
#전체 프레임에 대해서 isnull 해줄필요가없지 실전에서는, 
# 삐꾸나는 컬럼은 전체 컬럼 20개중에서 소수일뿐이다. 
# 전체 대상으로 마스크를 만들필요는 없는거지.
# 마스크 만들어서, 심어주는 것이다. 
# 기존 데이터프레임에 삽입 되도록 하기.ㅣ
# 결측치 행만을 추출하려면???? 
data[data['total2_copy'].isna()]

#결측치 들어있는 행을 삭제할때가 있고, 
#열을 삭제할때가 있다. 

#근데 이 행을 진짜 삭제해도 되는가? 확인 할때 이 기능을 활용할수있겠다. 

data.loc[data['total2_copy'].isna()]

# iloc 는 못쓰죠 여기엔 인덱스 와야하니까. 쓸려면 문제가 되겠죠.

  city  total1   total2  total2_copy
1   경기   75000  18000.0          NaN

In [532]:
#데이터프레임 복사
data_copy = data
data_copy

  city  total1   total2  total2_copy
0   서울   12000  15000.0      15000.0
1   경기   75000  18000.0          NaN
2   제주   63000  66000.0      66000.0
3   부산   42000  50000.0      50000.0

In [533]:
#복사체의 값 변경
data_copy.loc[2,'total2'] = 20
data_copy

  city  total1   total2  total2_copy
0   서울   12000  15000.0      15000.0
1   경기   75000  18000.0          NaN
2   제주   63000     20.0      66000.0
3   부산   42000  50000.0      50000.0

In [534]:
data
# 주소만 복사하면,  1개의 데이터프레임을 2개의 alias 만 추가된꼴이다.

# 새 데이터프레임 객체를 생성하기위한 진짜복사가 필요하다!! 


# 얕은 복사 -->> 주소복사  -->> 원본은 그대로, alias 만 추가된것.
# 깊은 복사 -->> 메모리복사 -->> 원본의 복제본 + 거기에대한alias 도 추가한것.

# copy() 를 쓴다.

  city  total1   total2  total2_copy
0   서울   12000  15000.0      15000.0
1   경기   75000  18000.0          NaN
2   제주   63000     20.0      66000.0
3   부산   42000  50000.0      50000.0

In [535]:
print(id(data))
print(id(data_copy))
data_copy2 = data.copy()
print(id(data_copy2))

2569909154336
2569909154336
2569909154336